# St7GetLoadPathTemplateNumByIndex

Returns the load path template number associated with the specified template index. The load path template
indices are stored internally and are based on a contiguous numbering system.

long St7GetLoadPathTemplateNumByIndex(long uID, long Index, long* TemplateID)
Input Parameters
uID
Strand7 model file ID.
Index
Load path template index.
Output Parameters
TemplateID
Load path template ID.